# 5. 데이터 확인

In [105]:
import pandas as pd
df = pd.read_excel(r'C:\Private_Projects\nadocoding\PythonDataWorkspace\Pandas\score.xlsx', index_col=0)
df

,name,club,height,Language,English,Math,science,Society,SW
지원번호,,,,,,,,,
1번,kronii,EN,168,10,85,10,20,75,Python
2번,botan,JP,166,30,35,65,95,35,Java
3번,anya,ID,147,60,50,45,45,20,Javascript
4번,mio,JP,160,90,30,35,90,90,NaN
5번,roboco,JP,154,80,15,75,55,45,NaN
6번,Marine,JP,150,65,80,55,75,95,C
7번,Baelz,EN,149,69,69,69,69,100,PYTHON
8번,okayu,JP,152,35,10,95,85,55,C#

## DataFrame 확인
계산 가능한 데이터에 대해 Column 별로 데이터의 갯수, 평균, 표준편차, 최소/최대값 등의 정보를 보여줌

In [106]:
df.describe()

           height   Language    English       Math    science     Society
count    8.000000   8.000000   8.000000   8.000000   8.000000    8.000000
mean   155.750000  54.875000  46.750000  56.125000  66.750000   64.375000
std      7.977647  27.310058  28.912429  26.215794  25.471272   29.932961
min    147.000000  10.000000  10.000000  10.000000  20.000000   20.000000
25%    149.750000  33.750000  26.250000  42.500000  52.500000   42.500000
50%    153.000000  62.500000  42.500000  60.000000  72.000000   65.000000
75%    161.500000  71.750000  71.750000  70.500000  86.250000   91.250000
max    168.000000  90.000000  85.000000  95.000000  95.000000  100.000000

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1번 to 8번
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      8 non-null      object
 1   club      8 non-null      object
 2   height    8 non-null      int64
 3   Language  8 non-null      int64
 4   English   8 non-null      int64
 5   Math      8 non-null      int64
 6   science   8 non-null      int64
 7   Society   8 non-null      int64
 8   SW        6 non-null      object
dtypes: int64(6), object(3)
memory usage: 640.0+ bytes

In [108]:
df.head() # 처음 5개의 row 를 가져옴

,name,club,height,Language,English,Math,science,Society,SW
지원번호,,,,,,,,,
1번,kronii,EN,168,10,85,10,20,75,Python
2번,botan,JP,166,30,35,65,95,35,Java
3번,anya,ID,147,60,50,45,45,20,Javascript
4번,mio,JP,160,90,30,35,90,90,NaN
5번,roboco,JP,154,80,15,75,55,45,NaN

In [109]:
df.head(7) # 처음 7개의 row 를 가져옴

,name,club,height,Language,English,Math,science,Society,SW
지원번호,,,,,,,,,
1번,kronii,EN,168,10,85,10,20,75,Python
2번,botan,JP,166,30,35,65,95,35,Java
3번,anya,ID,147,60,50,45,45,20,Javascript
4번,mio,JP,160,90,30,35,90,90,NaN
5번,roboco,JP,154,80,15,75,55,45,NaN
6번,Marine,JP,150,65,80,55,75,95,C
7번,Baelz,EN,149,69,69,69,69,100,PYTHON

In [110]:
df.tail() # 마지막 5개 row를 가져옴

        name club  height  Language  English  Math  science  Society      SW
지원번호
4번       mio   JP     160        90       30    35       90       90     NaN
5번    roboco   JP     154        80       15    75       55       45     NaN
6번    Marine   JP     150        65       80    55       75       95       C
7번     Baelz   EN     149        69       69    69       69      100  PYTHON
8번     okayu   JP     152        35       10    95       85       55      C#

In [111]:
df.tail(3) # 마지막 3개 row 를 가져옴

        name club  height  Language  English  Math  science  Society      SW
지원번호
6번    Marine   JP     150        65       80    55       75       95       C
7번     Baelz   EN     149        69       69    69       69      100  PYTHON
8번     okayu   JP     152        35       10    95       85       55      C#

In [112]:
df.values

array([['kronii', 'EN', 168, 10, 85, 10, 20, 75, 'Python'],
       ['botan', 'JP', 166, 30, 35, 65, 95, 35, 'Java'],
       ['anya', 'ID', 147, 60, 50, 45, 45, 20, 'Javascript'],
       ['mio', 'JP', 160, 90, 30, 35, 90, 90, nan],
       ['roboco', 'JP', 154, 80, 15, 75, 55, 45, nan],
       ['Marine', 'JP', 150, 65, 80, 55, 75, 95, 'C'],
       ['Baelz', 'EN', 149, 69, 69, 69, 69, 100, 'PYTHON'],
       ['okayu', 'JP', 152, 35, 10, 95, 85, 55, 'C#']], dtype=object)

In [113]:
df.index

Index(['1번', '2번', '3번', '4번', '5번', '6번', '7번', '8번'], dtype='object', name='지원번호')

In [114]:
df.index[0]

'1번'

In [115]:
df.columns

Index(['name', 'club', 'height', 'Language', 'English', 'Math', 'science',
       'Society', 'SW'],
      dtype='object')

In [116]:
df.shape # row, column

(8, 9)

In [117]:
df

,name,club,height,Language,English,Math,science,Society,SW
지원번호,,,,,,,,,
1번,kronii,EN,168,10,85,10,20,75,Python
2번,botan,JP,166,30,35,65,95,35,Java
3번,anya,ID,147,60,50,45,45,20,Javascript
4번,mio,JP,160,90,30,35,90,90,NaN
5번,roboco,JP,154,80,15,75,55,45,NaN
6번,Marine,JP,150,65,80,55,75,95,C
7번,Baelz,EN,149,69,69,69,69,100,PYTHON
8번,okayu,JP,152,35,10,95,85,55,C#

## Series 확인

In [118]:
df['height'].describe()

count      8.000000
mean     155.750000
std        7.977647
min      147.000000
25%      149.750000
50%      153.000000
75%      161.500000
max      168.000000
Name: height, dtype: float64

In [119]:
df['height'].min()

147

In [120]:
df['height'].max()

168

In [121]:
df['height'].nlargest(3) # 키 큰 사람 순서대로 3명 데이트

지원번호
1번    168
2번    166
4번    160
Name: height, dtype: int64

In [122]:
df['height'].mean()

155.75

In [123]:
df['height'].sum()

1246

In [124]:
df['SW'].count()

6

In [125]:
df['club'].unique()

array(['EN', 'JP', 'ID'], dtype=object)

In [126]:
df['club'].nunique()

3